nagyjose/DP/Kontrola_Syst/STM32_WPAN/App/p2p_server_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
 * @file    p2p_server_app.c
 * @author  MCD Application Team
 * @brief   peer to peer Server Application
  ******************************************************************************
  */
/* USER CODE END Header */

#include "p2p_server_app.h"
#include "dbg_trace.h"
#include "app_conf.h"
#include "ble.h"
#include "hci_tl.h"
#include "stm32_seq.h"
#include "flash_logger.h"
#include <stdbool.h>
#include "app_ffd_mac_802_15_4_process.h"

extern void System_Signalize_Start(uint8_t seconds);

// --- NAŠE UNIKÁTNÍ UUID (128-bit) ---
#define COPY_SERVICE_UUID(uuid_struct) { \
  (uuid_struct)[0]=0x19; (uuid_struct)[1]=0xed; (uuid_struct)[2]=0x82; (uuid_struct)[3]=0xae; \
  (uuid_struct)[4]=0xed; (uuid_struct)[5]=0x21; (uuid_struct)[6]=0x4c; (uuid_struct)[7]=0x9d; \
  (uuid_struct)[8]=0x41; (uuid_struct)[9]=0x45; (uuid_struct)[10]=0x22; (uuid_struct)[11]=0x8e; \
  (uuid_struct)[12]=0x40; (uuid_struct)[13]=0xFE; (uuid_struct)[14]=0x00; (uuid_struct)[15]=0x00; }

#define COPY_RX_UUID(uuid_struct) { (uuid_struct)[12]=0x41; (uuid_struct)[13]=0xFE; }
#define COPY_TX_UUID(uuid_struct) { (uuid_struct)[12]=0x42; (uuid_struct)[13]=0xFE; }

static uint16_t OrienteeringServiceHdle;
static uint16_t RxCharHdle;
static uint16_t TxCharHdle;
static uint16_t current_conn_handle = 0xFFFF; // Handle aktuálního spojení
static bool sleep_pending = false;            // Čekáme na slušné odpojení?

// =============================================================================
// SEZNAM HLAVNÍCH BLE PŘÍKAZŮ
// =============================================================================
typedef enum {
    // --- Bezpečnost a Relace ---
    CMD_UNLOCK              = 0x05,
    CMD_LOCK                = 0x06,
    CMD_VERIFY_HASH         = 0x07,

    // --- Čtení dat ---
    CMD_READ_CONFIG         = 0x10,
    CMD_DOWNLOAD_CURRENT    = 0x20,
    CMD_DOWNLOAD_ALL        = 0x21,
    CMD_DOWNLOAD_SPECIFIC   = 0x22,

    // --- Zápis do Konfigurace (Staging) ---
    CMD_STAGE_PARAM         = 0x12,
    CMD_COMMIT_CONFIG       = 0x13,

    // --- Nástroje ---
    CMD_IDENTIFY            = 0x40,
		CMD_SLEEP               = 0x51,  // PŘIDÁNO: Příkaz pro návrat do MAC

    // --- Mazání a Resety ---
    CMD_RESET_CONFIG        = 0x97,
    CMD_RESET_ALL           = 0x98,
    CMD_FORMAT_HISTORY      = 0x99
} BLE_Command_t;

// =============================================================================
// SEZNAM PARAMETRŮ PRO ÚPRAVU KONFIGURACE (Pro příkaz 0x12)
// =============================================================================
typedef enum {
    // --- Základní informace ---
    PARAM_BLE_DEVICE_NAME   = 0x01,
    PARAM_HASH_DEVICE       = 0x02,

    // --- Vysílané informace (Maják) ---
    PARAM_STAT_DEVICE_TYPE  = 0x03, // 12bit ID Kontroly (CLEAR, START, atd.)
    PARAM_REQ_RSSI          = 0x04,
    PARAM_EVENT_NATION      = 0x05,
    PARAM_EVENT_ID          = 0x06,

    // --- Nastavovací parametry ---
    PARAM_BEACON_PERIOD_MS  = 0x07,
    PARAM_BEACON_PERIOD_LP  = 0x08,
    PARAM_BUZZER_ONOFF      = 0x09,
    PARAM_TX_POWER          = 0x0A,
    PARAM_BAT_ALERT_THRESH  = 0x0B,

    // --- Informace o vlastníkovi (Oddíl) ---
    PARAM_TEAM_OWNER        = 0x0C,
    PARAM_TEAM_SHORTCUT     = 0x0D,
    PARAM_TEAM_NATION       = 0x0E,
    PARAM_TEAM_LEADER       = 0x0F,
    PARAM_TEAM_EMAIL        = 0x10,
    PARAM_TEAM_PHONE        = 0x11,
    PARAM_TEAM_ADDRESS      = 0x12,
    PARAM_TEAM_BANK         = 0x13,
    PARAM_TEAM_IBAN         = 0x14,
    PARAM_TEAM_BIC          = 0x15,
    PARAM_TEAM_ORISID       = 0x16,
    PARAM_TEAM_OTHER_INFO   = 0x17
} Config_Param_t;

// Zpřístupnění hlavního RTC ovladače z main.c
extern RTC_HandleTypeDef hrtc;

// -----------------------------------------------------------------------------
// PŘEVODNÍK: UNIX TIMESTAMP -> STM32 RTC KALENDÁŘ
// -----------------------------------------------------------------------------
static void Convert_UnixToRTC(uint32_t unix_time, RTC_TimeTypeDef *time, RTC_DateTypeDef *date)
{
    // Výpočet času v rámci dne
    uint32_t days = unix_time / 86400;
    uint32_t seconds_in_day = unix_time % 86400;

    time->Seconds = seconds_in_day % 60;
    time->Minutes = (seconds_in_day / 60) % 60;
    time->Hours = seconds_in_day / 3600;

    // Matematická magie pro převod dnů na kalendář (Shift z roku 1970)
    uint32_t z = days + 719468;
    uint32_t era = (z >= 0 ? z : z - 146096) / 146097;
    uint32_t doe = (z - era * 146097);
    uint32_t yoe = (doe - doe/1460 + doe/36524 - doe/146096) / 365;
    uint32_t y = yoe + era * 400;
    uint32_t doy = doe - (365*yoe + yoe/4 - yoe/100);
    uint32_t mp = (5*doy + 2)/153;
    uint32_t d = doy - (153*mp+2)/5 + 1;
    uint32_t m = mp + (mp < 10 ? 3 : -9);
    uint32_t year = y + (m <= 2);

    // Uložení do STM32 struktur
    date->Date = d;
    date->Month = m;
    date->Year = year - 2000; // STM32 používá jen roky 0-99 (vztaženo k roku 2000)

    // Výpočet dne v týdnu (1.1.1970 byl čtvrtek = 4)
    date->WeekDay = (days + 4) % 7;
    if (date->WeekDay == 0) date->WeekDay = 7; // STM32 počítá týden 1-7 (Pondělí - Neděle)
}

// =============================================================================
// STAVOVÉ PROMĚNNÉ PRO KRÁJEČ (CHUNKER)
// =============================================================================
static uint8_t *chunk_ptr = NULL;        // Ukazatel na to, co zrovna odesíláme
static uint32_t chunk_rem_len = 0;       // Kolik bajtů nám ještě zbývá odeslat
static uint8_t  chunk_active_cmd = 0;    // Jaký příkaz se zrovna vykonává

#define CHUNK_MAX_SIZE 20 // Maximální velikost jedné rány (BLE MTU to bezpečně snese)

// =============================================================================
// STAVOVÉ PROMĚNNÉ PRO RELACI (SESSION & STAGING)
// =============================================================================
static bool is_unlocked = false;           // Stav zámku (Odemčeno / Zamčeno)
static BeaconConfig_t staged_config;       // RAM kopie konfigurace KONTROLY pro úpravy      // RAM kopie konfigurace pro úpravy

