nagyjose/DP/Kontrola_Syst/STM32_WPAN/App/p2p_server_app.c
							// !!! OPRAVA GATT 133: Dáme koprocesoru 100 ms na fyzické odeslání !!!
							HAL_Delay(100);

							if (current_conn_handle != 0xFFFF) {
								// 0x13 = Remote User Terminated Connection (Slusne odpojeni)
								aci_gap_terminate(current_conn_handle, 0x13);
							} else {
								// Pojistka: Kdybychom handle neměli, přepneme rovnou
								UTIL_SEQ_SetTask(1U << CFG_TASK_INIT_SWITCH_PROTOCOL, CFG_SCH_PRIO_0);
							}
							break;

						// =====================================================
						// 1A. KROK 1: MOBIL ŽÁDÁ O VÝZVU (0x05)
						// Paket z mobilu: [0x05]
						// =====================================================
						case CMD_UNLOCK:
							// Vygenerujeme náhodné číslo (Využijeme ticky procesoru a UDN čipu)
							current_challenge = HAL_GetTick() ^ DEVICE_CONFIG->magic_word ^ LL_FLASH_GetUDN();

							// Pokud by náhodou vyšla nula (neplatná výzva), změníme ji
							if (current_challenge == 0) current_challenge = 0xDEADBEEF;

							APP_DBG(">>> BLE SECURITY: Generuji vyzvu: %lu", current_challenge);

							// Odešleme výzvu do mobilu (0x05 + 4 bajty výzvy)
							uint8_t ack_chal[5] = {0x05,
																		(current_challenge >> 24) & 0xFF,
																		(current_challenge >> 16) & 0xFF,
																		(current_challenge >> 8)  & 0xFF,
																		 current_challenge        & 0xFF};
							BLE_Tunnel_Send(ack_chal, 5);
							break;

						// =====================================================
						// 1B. KROK 2: MOBIL POSÍLÁ RESPONSE K OVĚŘENÍ (0x07)
						// Paket z mobilu: [0x07] [Resp_1] [Resp_2] [Resp_3] [Resp_4]
						// =====================================================
						case CMD_VERIFY_HASH:
							if (mod->Attr_Data_Length >= 5) {
								// Přečteme Response od mobilu
								uint32_t received_response = ((uint32_t)mod->Attr_Data[1] << 24) |
																						 ((uint32_t)mod->Attr_Data[2] << 16) |
																						 ((uint32_t)mod->Attr_Data[3] << 8)  |
																							(uint32_t)mod->Attr_Data[4];

								// Vypočítáme si, co měl mobil reálně poslat (POUŽIJEME hash_device)
								uint32_t expected_response = Generate_Response(current_challenge, DEVICE_CONFIG->hash_device);

								// Ověření! (Zároveň kontrolujeme, že výzva byla vůbec vygenerována)
								if (received_response == expected_response && current_challenge != 0) {
									is_unlocked = true;
									current_challenge = 0; // Výzva se smí použít jen jednou! (Obrana proti replay)

									// Zkopírujeme aktuální stav z Flash do naší RAM (Stagingu)
									memcpy(&staged_config, (void*)DEVICE_CONFIG, sizeof(BeaconConfig_t));

									APP_DBG(">>> BLE SECURITY: ODEMCENO! Hash sedi. Relace spustena.");
									uint8_t ack[4] = {0x07, 0x01, 0x00, 0x00}; BLE_Tunnel_Send(ack, 4);
								} else {
									APP_DBG(">>> BLE SECURITY: SPATNA ODPOVED! Utocnik?");
									current_challenge = 0; // Při chybě výzvu okamžitě spálíme
									uint8_t ack[4] = {0x07, 0xEE, 0x00, 0x00}; BLE_Tunnel_Send(ack, 4);
								}
							}
							break;

						// =====================================================
						// 2. ZAMČENÍ RELACE (0x06)
						// Paket: [0x06]
						// =====================================================
						case CMD_LOCK:
							is_unlocked = false;
							memset(&staged_config, 0, sizeof(BeaconConfig_t)); // Bezpečný výmaz RAM
							APP_DBG(">>> BLE SECURITY: ZAMCENO uzivatelem.");
							uint8_t ack_lock[4] = {0x06, 0x01, 0x00, 0x00}; BLE_Tunnel_Send(ack_lock, 4);
							break;

						// =====================================================
						// 3. POSTUPNÉ SKLÁDÁNÍ DO RAM (0x12 - STAGE PARAMETER)
						// Paket: [0x12] [ID] [Offset_H] [Offset_L] [Data...]
						// =====================================================
						case CMD_STAGE_PARAM:
							if (!is_unlocked) {
									APP_DBG(">>> BLE SECURITY: Zamitnuto (ZAMCENO)");
									uint8_t ack[4] = {0x12, 0xEE, 0x00, 0x00}; BLE_Tunnel_Send(ack, 4);
									break;
							}

							if (mod->Attr_Data_Length >= 5) {
								Config_Param_t param_id = (Config_Param_t)mod->Attr_Data[1];
								uint16_t offset = (mod->Attr_Data[2] << 8) | mod->Attr_Data[3];
								uint8_t data_len = mod->Attr_Data_Length - 4;
								uint8_t *payload = &mod->Attr_Data[4];

								APP_DBG(">>> BLE STAGE: Param 0x%02X, Offset: %d, Delka: %d", param_id, offset, data_len);

								// Úprava konkrétních proměnných KONTROLY v RAM
								switch (param_id) {
									// --- 1. ZÁKLADNÍ INFORMACE ---
									case PARAM_BLE_DEVICE_NAME: if (offset + data_len <= 32) memcpy(&staged_config.BLE_device_name[offset], payload, data_len); break;
									case PARAM_HASH_DEVICE: if (data_len >= 4) staged_config.hash_device = ((uint32_t)payload[0]<<24) | ((uint32_t)payload[1]<<16) | ((uint32_t)payload[2]<<8) | payload[3]; break;

									// --- 2. VYSÍLANÉ INFORMACE ---
									case PARAM_STAT_DEVICE_TYPE: if (data_len >= 2) staged_config.stat_device_type = ((uint16_t)payload[0]<<8) | payload[1]; break;
									case PARAM_REQ_RSSI: if (data_len >= 1) staged_config.required_rssi = payload[0]; break;
									case PARAM_EVENT_NATION: if (data_len >= 1) staged_config.event_nation = payload[0]; break;
									case PARAM_EVENT_ID: if (data_len >= 4) staged_config.event_id = ((uint32_t)payload[0]<<24) | ((uint32_t)payload[1]<<16) | ((uint32_t)payload[2]<<8) | payload[3]; break;

									// --- 3. NASTAVOVACÍ PARAMETRY ---
									case PARAM_BEACON_PERIOD_MS: if (data_len >= 1) staged_config.beacon_period_ms = payload[0]; break;
									case PARAM_BEACON_PERIOD_LP: if (data_len >= 1) staged_config.beacon_period_ms_lp = payload[0]; break;
									case PARAM_BUZZER_ONOFF: if (data_len >= 1) staged_config.buzzer_onoff = payload[0]; break;
									case PARAM_TX_POWER: if (data_len >= 1) staged_config.tx_power = (int8_t)payload[0]; break;
									case PARAM_BAT_ALERT_THRESH: if (data_len >= 1) staged_config.battery_alert_threshold = payload[0]; break;

									// --- 4. TEXTY A VLASTNÍK (Ukázka několika) ---
									case PARAM_TEAM_OWNER: if (offset + data_len <= 64) memcpy(&staged_config.team_owner[offset], payload, data_len); break;
									case PARAM_TEAM_EMAIL: if (offset + data_len <= 64) memcpy(&staged_config.team_email[offset], payload, data_len); break;
									case PARAM_TEAM_OTHER_INFO: if (offset + data_len <= 1024) memcpy(&staged_config.team_other_info[offset], payload, data_len); break;
									// (Zde si můžeš dopsat zbytek podle potřeby)

									default:
										APP_DBG(">>> BLE STAGE: Neznamy parametr (0x%02X)", param_id);
										uint8_t ack_err[4] = {0x12, 0xEE, param_id, 0x00}; BLE_Tunnel_Send(ack_err, 4);
										break;
								}

								uint8_t ack[4] = {0x12, 0x01, param_id, 0x00}; BLE_Tunnel_Send(ack, 4);
							}
							break;

