nagyjose/DP/Kontrola_Syst/STM32_WPAN/App/p2p_server_app.c
						// =====================================================
						// 4. HROMADNÝ ZÁPIS DO FLASH (0x13 - COMMIT)
						// Paket: [0x13]
						// =====================================================
						case CMD_COMMIT_CONFIG:
							if (!is_unlocked) {
								uint8_t ack[4] = {0x13, 0xEE, 0x00, 0x00}; BLE_Tunnel_Send(ack, 4);
								break;
							}

							APP_DBG(">>> BLE COMMIT: Zapisuji vsechny RAM upravy do Flash!");
							Config_Commit(&staged_config);

							uint8_t ack_com[4] = {0x13, 0x01, 0x00, 0x00}; BLE_Tunnel_Send(ack_com, 4);
							break;

						// =====================================================
						// 5. BEZPEČNÝ FORMÁT PAMĚTI (0x99)
						// Nyní nevyžaduje PIN v paketu, protože je chráněn zámkem!
						// =====================================================
						case CMD_FORMAT_HISTORY:
							if (!is_unlocked) {
								APP_DBG(">>> BLE SECURITY: Zamitnuto - Formát vyžaduje odemknuti!");
								uint8_t ack[4] = {0x99, 0xEE, 0x00, 0x00}; BLE_Tunnel_Send(ack, 4);
								break;
							}

							APP_DBG(">>> BLE CMD: FORMATOVANI PAMETI ZAVODNIKA! (0x99)");
							chunk_rem_len = 0;
							Logger_FormatAll();
							uint8_t ack_fmt[4] = {0x99, 0x01, 0x00, 0x00}; BLE_Tunnel_Send(ack_fmt, 4);
							break;
						//}

						// =====================================================
						// 6. FACTORY RESET POUZE KONFIGURACE (0x97)
						// =====================================================
						case CMD_RESET_CONFIG:
							if (!is_unlocked) {
								uint8_t ack[4] = {0x97, 0xEE, 0x00, 0x00}; BLE_Tunnel_Send(ack, 4);
								break;
							}

							// Odešleme mobilu zprávu o úspěchu ještě PŘED restartem
							uint8_t ack_97[4] = {0x97, 0x01, 0x00, 0x00};
							BLE_Tunnel_Send(ack_97, 4);

							// Necháme paket 100 ms odletět a pak desku zabijeme
							HAL_Delay(100);
							Config_EraseAndReboot();
							break;

						// =====================================================
						// 7. KOMPLETNÍ FACTORY RESET - VŠE (0x98)
						// =====================================================
						case CMD_RESET_ALL:
							if (!is_unlocked) {
								uint8_t ack[4] = {0x98, 0xEE, 0x00, 0x00}; BLE_Tunnel_Send(ack, 4);
								break;
							}

							// Odešleme mobilu zprávu o úspěchu ještě PŘED restartem
							uint8_t ack_98[4] = {0x98, 0x01, 0x00, 0x00};
							BLE_Tunnel_Send(ack_98, 4);

							// Necháme paket 100 ms odletět a pak spustíme kompletní destrukci
							HAL_Delay(100);
							System_FactoryResetAll();
							break;

						default:
							APP_DBG(">>> BLE CMD: NEZNAMY PRIKAZ (0x%02X)", cmd);
							break;
					}
				}
				break;
			}
		}
	}
	return SVCCTL_EvtNotAck;
}

// -----------------------------------------------------------------------------
// INICIALIZACE: Registrace Služeb do BLE Stacku
// -----------------------------------------------------------------------------
void P2PS_APP_Init(void) {
	Char_UUID_t uuid;

	// Zaregistrujeme obsluhu BLE událostí
	SVCCTL_RegisterSvcHandler(Tunnel_Event_Handler);

	// Zaregistrujeme náš asynchronní úkol (Kráječ)
	UTIL_SEQ_RegTask(1 << CFG_TASK_BLE_CHUNKER, UTIL_SEQ_RFU, BLE_Chunker_Task);

	// 1. Přidání Služby
	COPY_SERVICE_UUID(uuid.Char_UUID_128);
	aci_gatt_add_service(UUID_TYPE_128, (Service_UUID_t *) &uuid, PRIMARY_SERVICE, 7, &OrienteeringServiceHdle);

	// 2. Přidání RX Charakteristiky (Mobil píše nám)
	uuid.Char_UUID_128[12] = 0x41; // RX UUID
	aci_gatt_add_char(OrienteeringServiceHdle, UUID_TYPE_128, &uuid, 244,
										CHAR_PROP_WRITE | CHAR_PROP_WRITE_WITHOUT_RESP,
										ATTR_PERMISSION_NONE, GATT_NOTIFY_ATTRIBUTE_WRITE, 10, 1, &RxCharHdle);

	// 3. Přidání TX Charakteristiky (My posíláme mobilu přes Notifikace)
	uuid.Char_UUID_128[12] = 0x42; // TX UUID
	aci_gatt_add_char(OrienteeringServiceHdle, UUID_TYPE_128, &uuid, 244,
										CHAR_PROP_NOTIFY,
										ATTR_PERMISSION_NONE, GATT_DONT_NOTIFY_EVENTS, 10, 1, &TxCharHdle);

	APP_DBG(">>> BLE TUNEL: Inicializovano a pripraveno!");
}

void BLE_Tunnel_Send(uint8_t *pPayload, uint16_t length) {
	aci_gatt_update_char_value(OrienteeringServiceHdle, TxCharHdle, 0, length, pPayload);
}

// -----------------------------------------------------------------------------
// CALLBACK: Stav připojení (Volá se z app_ble.c)
// -----------------------------------------------------------------------------
void P2PS_APP_Notification(P2PS_APP_ConnHandle_Not_evt_t *pNotification)
{
	switch (pNotification->P2P_Evt_Opcode)
	{
		case PEER_CONN_HANDLE_EVT:
			APP_DBG(">>> BLE TUNEL: Mobil pripojen!");
			current_conn_handle = pNotification->ConnectionHandle; // Uložíme si Handle
			break;

		case PEER_DISCON_HANDLE_EVT:
			APP_DBG(">>> BLE TUNEL: Mobil odpojen!");
			current_conn_handle = 0xFFFF; // Vymažeme Handle
			chunk_rem_len = 0;

			// BEZPEČNOST: Automaticky zamknout a smazat RAM buffer
			is_unlocked = false;
			memset(&staged_config, 0, sizeof(BeaconConfig_t));

			if (sleep_pending) {
				// Pokud mobil inicioval spánek (nebo jsme ho vykopli my přes CMD_SLEEP)
				sleep_pending = false;
				APP_DBG(">>> BLE TUNEL: Provedeno slusne odpojeni. Prepinam na MAC!");
				UTIL_SEQ_SetTask(1U << CFG_TASK_INIT_SWITCH_PROTOCOL, CFG_SCH_PRIO_0);
			} else {
				APP_DBG(">>> BLE SECURITY: Spojeni ztraceno -> AUTO-LOCK aktivovan!");
			}
			break;

		default:
			break;
	}
}


